clear all;
clc;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% % Часть 1
max_size = 500;
y = Euler(4,2);
t = 1:500;
plot(t,y);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% % Часть 2

quadratic;
Rosenbrock;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% % Часть 3

y_max = max(abs(y));

global delta_y;
delta_y(1) = y_max*0.005;                     % Погрешность 1
delta_y(2) = y_max*0.01;                      % Погрешность 2
delta_y(3) = y_max*0.02;                      % Погрешность 3
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
noise1 = noise_3(delta_y(1),100); % Шум от -0.2 до 0.2
noise2 = noise_3(delta_y(2),10000); % Шум от -0.4 до 0.4
noise3 = noise_3(delta_y(3),10000); % Шум от -0.8 до 0.8
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
[y_exp1] = y_exp_3(noise1,y);       % Зашумлённая функция 1 
[y_exp2] = y_exp_3(noise2,y);       % Зашумлённая функция 2
[y_exp3] = y_exp_3(noise3,y);       % Зашумлённая функция 3
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  
k = 5;                                        %Начальная переменная по k (реальная k = 4)
a1 = 3;                                       %Начальная переменная по a1 (реальная a1 = 2)

h = 0.01;                                       %Шаг
e = 0.01;                                     %Предел погрешности

[A1,cf1] = optim_3(y_exp1,h,e,k,a1);                %Оптимизация 1
%disp(A1(2000));
%disp(A1(2001));
[A2,cf2] = optim_3(y_exp2,h,e,k,a1);                %Оптимизация 2
[A3,cf3] = optim_3(y_exp3,h,e,k,a1);                %Оптимизация 3

draw_3(A1,y_exp1,cf1);
draw_3(A2,y_exp2,cf2);
draw_3(A3,y_exp3,cf3);


